clubchief/app/controllers/admin_users_controller.rb

  def index # needs a bug fix, only pulls the users first club
  	user = get_current_user
  	@club = Club.find(params[:club_id])
		team = @club.teams.where(:club_team => true).first
		@members = []
		@admins = []
		#iterate over all the users and separate out admins
		team.memberships.each do |membership|
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 1 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."club_team" = 't' AND ("teams".club_id = 1) LIMIT 1
SELECT "memberships".* FROM "memberships" WHERE ("memberships".team_id = 23)

  def new
  	user = get_current_user
    @user = User.new
    memberships = user.memberships.where(:admin => true)
---
SELECT "memberships".* FROM "memberships" WHERE "memberships"."admin" = 't' AND ("memberships".user_id = 2)