clubchief/app/controllers/admin_competitions_controller.rb

SELECT "memberships".* FROM "memberships" WHERE "memberships"."admin" = 't' AND ("memberships".user_id = 2)
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 1 LIMIT 1
SELECT "competitions".* FROM "competitions" WHERE ("competitions".club_id = 1)
SELECT "teams".* FROM "teams" WHERE "teams"."id" = 1 LIMIT 1
---
  def index
    user = get_current_user
    memberships = user.memberships.where(:admin => true)
    @competitions = []
    memberships.each do |membership|
      if membership.team.club_team
        membership.team.club.competitions.each do |competition|

SELECT "competitions"."id" FROM "competitions" WHERE "competitions"."id" = 1 LIMIT 1
---
  def show
    if Competition.exists?(params[:competition_id])
      @competition = Competition.find(params[:competition_id])

SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = 13 LIMIT 1
---
  def edit
  	@competition = Competition.find(params[:id])