clubchief/app/controllers/admin_teams_controller.rb

  def assign
    if Team.exists?(params[:team_id])
      @team = Team.find(params[:team_id])
      if @team.competition.deadline < Time.now
        if @team.competition.competition_finshed == false
              competition = @team.competition
              @unassigned_applications = competition.competition_applications.where(:assiged_to_team => false)
              @assigned_members =[]
              @assigned_admin = []
              @team.memberships.each do |membership|
---
SELECT "teams"."id" FROM "teams" WHERE "teams"."id" = 5 LIMIT 1
SELECT "competition_applications".* FROM "competition_applications" WHERE "competition_applications"."assiged_to_team" = 'f' AND ("competition_applications".competition_id = 1)
SELECT "competitions".* FROM "competitions" WHERE "competitions"."id" = 1 LIMIT 1
SELECT "memberships".* FROM "memberships" WHERE ("memberships".team_id = 5)