clubchief/app/controllers/calendar_controller.rb

  def index
    @month = (params[:month] || (Time.zone || Time).now.month).to_i
    @year = (params[:year] || (Time.zone || Time).now.year).to_i

    @shown_month = Date.civil(@year, @month)

	user = get_current_user
    @teams = user.teams

    if club_teams = @teams.where(:club_team => true)
   	club_teams.each do |club_team|
   			if club_team.memberships.find_by_user_id(user.id)
      			@teams  += Team.find_all_by_club_id(club_team.club_id)
      			@teams = @teams.uniq
      		end
    	end
    end

    @event_strips = Event.where(:team_id => @teams).event_strips_for_month(@shown_month)
---
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams".id = "memberships".team_id WHERE (("memberships".user_id = 2))
SELECT "events".* FROM "events" WHERE "events"."team_id" IN (1) AND (('2011-07-30 12:00:00.000000' <= end_at) AND (start_at< '2011-09-03 12:00:00.000000')) ORDER BY start_at ASC