clubchief/app/controllers/clubs_controller.rb

  def index
      user = get_current_user
      user_clubs = user.teams.where(:club_team => true).collect{|t| t.club}
	  @clubs = Club.all
---
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams".id = "memberships".team_id WHERE "teams"."club_team" = 't' AND (("memberships".user_id = 2))
SELECT "clubs".* FROM "clubs"

  def my_index
    	user = get_current_user
    	@clubs = user.teams.where(:club_team => true).collect{|t| t.club}
---
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams".id = "memberships".team_id WHERE "teams"."club_team" = 't' AND (("memberships".user_id = 2))

  def apply
    	user = get_current_user
    	club = Club.find(params[:id])
    	if  user.is_member_of?(club.id)
        	flash[:alert] = "You have already added "+club.name+" to your profile"
    	else
      		team = club.teams.where(:club_team => true).first
      		membership = user.memberships.new
      		membership.team = team
      		if  membership.save
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 12 LIMIT 1
SELECT "teams".* FROM "teams" WHERE "teams"."club_team" = 't' AND ("teams".club_id = 12) LIMIT 1
INSERT INTO "memberships" ("user_id", "team_id", "admin", "created_at", "updated_at") VALUES (2, 23, 'f', '2011-09-09 04:19:45.352408', '2011-09-09 04:19:45.352408')

  def remove
   	club = Club.find(params[:id])
   	user = get_current_user
   	teams = club.teams

	teams.each do |team|
		#remove any events from the users teams
		if team.events.any?
			Attendee.delete(team.attendees.where(:user_id => user.id))
		end

		#remove any competition_applications
	 	if team.competition_id != nil
	  		CompetitionApplication.delete(team.competition_applications.where(:user_id => user.id))
	  	end

		if membership = team.memberships.find_by_user_id(user.id)
      			#and try to delete the membership
        		if Membership.delete(membership)
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 12 LIMIT 1
SELECT "teams".* FROM "teams" WHERE ("teams".club_id = 12)
SELECT COUNT(*) FROM "events" WHERE ("events".team_id = 23)
DELETE FROM "attendees" WHERE "attendees"."id" IN (100)
SELECT "attendees".* FROM "attendees" INNER JOIN "events" ON "attendees".event_id = "events".id WHERE "attendees"."user_id" = 2 AND (("events".team_id = 23))
SELECT "memberships".* FROM "memberships" WHERE "memberships"."user_id" = 2 AND ("memberships".team_id = 23) LIMIT 1
DELETE FROM "memberships" WHERE "memberships"."id" = 176