clubchief/app/controllers/competition_applications_controller.rb

SELECT "competition_applications".* FROM "competition_applications" WHERE "competition_applications"."assiged_to_team" = 'f' AND ("competition_applications".user_id = 2)
---
  def index
      user = get_current_user
      @pending_applications = user.competition_applications.where(:assiged_to_team => false)