clubchief/app/controllers/competitions_controller.rb

SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = 1 LIMIT 1
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams".id = "memberships".team_id WHERE (("memberships".user_id = 2))
SELECT "competitions".* FROM "competitions" WHERE ("competitions".club_id = 1)
SELECT "competition_applications".* FROM "competition_applications" WHERE ("competition_applications".competition_id = 2)
---
  def index
      user = get_current_user
      clubs = user.teams.collect{|team| team.club}.uniq
      @competitions = []
      clubs.each do |club|
        club.competitions.each do |competition|
          #has the competiton passed the application deadline.
          if competition.deadline > Time.now
            #the following is a check for if the user already has any applications to this competition
            if (competition.competition_applications & user.competition_applications).empty?