clubchief/app/controllers/notifications_controller.rb

 def show
      user = get_current_user
      @teams = user.teams

      if club_teams = @teams.where(:club_team => true)
       club_teams.each do |club_team|
           if club_team.memberships.find_by_user_id(user.id)
              @teams  += Team.find_all_by_club_id(club_team.club_id)
              @teams = @teams.uniq
            end
        end
      end

      @notifications = Notification.where(:team_id => @teams).paginate( :per_page => 10, :page => params[:page])
---
SELECT "teams".* FROM "teams" INNER JOIN "memberships" ON "teams".id = "memberships".team_id WHERE (("memberships".user_id = 2))
SELECT "notifications".* FROM "notifications" WHERE ("notifications".team_id = 1)