clubchief/app/controllers/teams_controller.rb

SELECT "teams".* FROM "teams" WHERE ("teams".club_id = 1)
---
  def index
    @user = get_current_user
    teams = @user.get_manageable_teams
    @manageable_teams = teams.select{|team|team.club_team == false }